__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
signal (InputLayer)             (None, 4096, 12)     0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 4096, 64)     12288       signal[0][0]                     
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 4096, 64)     256         conv1d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 4096, 64)     0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 4096, 128)    131072      activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 4096, 128)    512         conv1d_3[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 4096, 128)    0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 4096, 128)    0           activation_2[0][0]               
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 1024, 64)     0           activation_1[0][0]               
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 1024, 128)    262144      dropout_1[0][0]                  
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 1024, 128)    8192        max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
add_1 (Add)                     (None, 1024, 128)    0           conv1d_4[0][0]                   
                                                                 conv1d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 1024, 128)    512         add_1[0][0]                      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 1024, 128)    0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 1024, 128)    0           activation_3[0][0]               
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 1024, 196)    401408      dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 1024, 196)    784         conv1d_6[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 1024, 196)    0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 1024, 196)    0           activation_4[0][0]               
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 256, 128)     0           add_1[0][0]                      
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 256, 196)     614656      dropout_3[0][0]                  
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 256, 196)     25088       max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
add_2 (Add)                     (None, 256, 196)     0           conv1d_7[0][0]                   
                                                                 conv1d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 256, 196)     784         add_2[0][0]                      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 256, 196)     0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 256, 196)     0           activation_5[0][0]               
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 256, 256)     802816      dropout_4[0][0]                  
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 256, 256)     1024        conv1d_9[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 256, 256)     0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 256, 256)     0           activation_6[0][0]               
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 64, 196)      0           add_2[0][0]                      
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 64, 256)      1048576     dropout_5[0][0]                  
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 64, 256)      50176       max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
add_3 (Add)                     (None, 64, 256)      0           conv1d_10[0][0]                  
                                                                 conv1d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 64, 256)      1024        add_3[0][0]                      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 64, 256)      0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 64, 256)      0           activation_7[0][0]               
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 64, 320)      1310720     dropout_6[0][0]                  
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 64, 320)      1280        conv1d_12[0][0]                  
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 64, 320)      0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 64, 320)      0           activation_8[0][0]               
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 16, 256)      0           add_3[0][0]                      
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, 16, 320)      1638400     dropout_7[0][0]                  
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 16, 320)      81920       max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
add_4 (Add)                     (None, 16, 320)      0           conv1d_13[0][0]                  
                                                                 conv1d_11[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16, 320)      1280        add_4[0][0]                      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 16, 320)      0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 16, 320)      0           activation_9[0][0]               
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 5120)         0           dropout_8[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 6)            30726       flatten_1[0][0]                  
==================================================================================================
Total params: 6,425,638
Trainable params: 6,421,910
Non-trainable params: 3,728
__________________________________________________________________________________________________
